# -*- coding: utf-8 -*-            
# @Author : Chen_jia_wei
# @Time : 2023/5/9 14:41
"""
    我国古代数学家张丘建在《算经》一书中曾提出过著名的 “百钱买百鸡” 问题，该问题叙述如下：
            鸡翁一，值钱五；鸡母一，值钱三；鸡雏三，值钱一；百钱买百鸡，则翁、母、雏各几何？

    百钱买百鸡的问题算是一套非常经典的不定方程的问题，题目很简单：
            公鸡每只5元，母鸡每只3元，小鸡3只一元，现要求用100元钱买100只鸡(三种类型的鸡都要买)，问公鸡、母鸡、小鸡各买几只?


    数学解法：设公鸡买了x只，母鸡买了y只，小鸡买了z只

    数量关系式： x + y + z = 100

    钱的关系式：5x + 3y + z/3 = 100

    1.以公鸡为突破点，公鸡5元一只，100元最多只能买20只，由于三种鸡都要买，所以公鸡数一定是小于20的。

    2.母鸡每只3元，100全 拿来买母鸡，最多也不能超过33只机会。

    3.设公鸡数为x，母鸡数为y，小鸡z只

    4.只要满足 5x+3y+ z/3== 100 和 x + y + z == 100 就可以输出此种组合的结果。


"""

import time

# start = time.time()
# # 外层循环控制公鸡 数量 为 0~20
# for x in range(0, 21):
#     for y in range(0, 34):
#         for z in range(0, 101):
#             if (5 * x + 3 * y + z / 3 == 100) and (x + y + z == 100):
#                 print("公鸡有%d只\t母鸡有%d只\t小鸡有%d只" % (x, y, z))
# end = time.time()
# print("算法耗时", end - start)


start = time.time()
# 外层循环控制公鸡 数量
for x in range(0, 101, 5):  # 公鸡
    for y in range(3, 101 - x, 3):  # 母鸡
        z = 100 - x - y  # 小鸡
        if (x // 5 + y // 3 + z * 3 == 100) and (x + y + z == 100):
            print("公鸡有%d只\t母鸡有%d只\t小鸡有%d只" % (x // 5, y // 3, z * 3))
end = time.time()
print("算法耗时", end - start)
